## Pandas DataFrames

### how we create the dataframes ?

In [18]:
import pandas as pd

In [19]:
import numpy as np

In [20]:
#creating dataframes from nested list or nd array
data=[
    ["Himanshu",45],
    ["Sakshi",44],
    ["Vivan",42]
]

In [21]:
df=pd.DataFrame(data)
df

          0   1
0  Himanshu  45
1    Sakshi  44
2     Vivan  42

In [22]:
#if you wish to provide column name explicitly
df=pd.DataFrame(
    data,
    columns=["Name","Age"],
    index=["A","B","C"]
)
df

       Name  Age
A  Himanshu   45
B    Sakshi   44
C     Vivan   42

In [23]:
data={
    "Name":["Himanshu","Vivan","Rajendra"],
    "Age":[23,20,51] 
    
}

In [24]:
df=pd.DataFrame(data,index=[1,2,3])

In [25]:
df

       Name  Age
1  Himanshu   23
2     Vivan   20
3  Rajendra   51

In [26]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [27]:
df.index

Int64Index([1, 2, 3], dtype='int64')

In [28]:
df.Name.dtype #object type

dtype('O')

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 72.0+ bytes

In [30]:
df.Name.value_counts()

Himanshu    1
Vivan       1
Rajendra    1
Name: Name, dtype: int64

In [31]:
df.isna() #no na value thats y getting false

    Name    Age
1  False  False
2  False  False
3  False  False

In [32]:
#Reading Dataframe from a CSV file
#df=pd.read_csv(
#    "file name",
#    skiprows=1,
#    header=None
#)

In [33]:
#df.sample(5)

In [34]:
#df.iloc[::].to_csv("")

In [45]:
df=pd.DataFrame({
    "one":pd.Series([1,2,3],index=list("abc")),
    "two":pd.Series([1,2,3,4],index=list("abcd"))
})
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [46]:
df["three"]=df["one"]+df["two"]
df

   one  two  three
a  1.0    1    2.0
b  2.0    2    4.0
c  3.0    3    6.0
d  NaN    4    NaN

In [47]:
del df["three"]  #cant retrieve the value every after using del

In [48]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [49]:
popped_item=df.pop("one")
df

   two
a    1
b    2
c    3
d    4

In [50]:
popped_item

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [51]:
for x in df:print(x)

two

In [52]:
for y in df:print(y)

two

### Indexing and Slicing on DATA FRAMES

#### loc (special indexing or slicing function or method )
you use labels of rows and columns

#### iLoc
it works with the rows and columns position

In [53]:
#df=pd.read_clipboard() #print copied data automatically